app/controllers/comments_controller.rb

  def destroy
    @comments  = Comment.all

    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT "comments".* FROM "comments"
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

  def index
    @comment  = Comment.new
    @comments  = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    @comments  = Comment.all

    @comment = Comment.new(comment_params)
      if  @comment.save
---
SELECT "comments".* FROM "comments"
INSERT INTO "comments" ("author", "created_at", "text", "updated_at") VALUES (?, ?, ?, ?)  [["author", "ddsdfsdf"], ["created_at", "2014-11-29 18:12:51.767391"], ["text", "sdfsdfsdf"], ["updated_at", "2014-11-29 18:12:51.767391"]]